In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model

In [2]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [7]:
from sklearn.ensemble import BaggingClassifier
from sklearn.neighbors import KNeighborsClassifier

In [8]:
from sklearn.ensemble import RandomForestClassifier

In [4]:
df = pd.read_csv('../data/final_data/entrenamiento_postulaciones_vistas4.csv', encoding='utf-8')
df.head()

,idaviso,idpostulante,timestamp,valor_educacion,sexo,idtitulo,idzona,idciudad,idmapacalle,idtipo_de_trabajo,idnivel_laboral,idnombre_area,iddenominacion_empresa,se_postulo
0,1111556097,365446,7.038007e+06,17,1,0,0,0,0,0,0,0,0,1
1,1112370711,365446,7.476885e+06,17,1,6996,0,0,0,0,0,45,14,1
2,1112326655,365446,9.809277e+06,17,1,11827,0,0,0,0,0,4,33,1
3,1112350182,365446,8.856385e+06,17,1,2141,0,0,0,0,0,31,38,1
4,1112383837,365446,7.563903e+06,17,1,6942,0,0,0,0,0,75,46,1

In [5]:
# X will have the numeric data, Y will have the target class
dfix = df.ix[:, 0:13];
X = np.array(dfix)
y = np.array(df['se_postulo'])

/usr/local/lib/python3.5/dist-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

In [6]:
# Split into train and test, use only 10% as test (15 flowers)
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=7506)
X_test

array([[  1.11241876e+09,   2.56340000e+04,   4.17343225e+06, ...,
          0.00000000e+00,   7.60000000e+01,   1.00000000e+01],
       [  1.11234254e+09,   1.24354000e+05,   8.95024431e+06, ...,
          0.00000000e+00,   1.30000000e+01,   1.79200000e+03],
       [  1.11227764e+09,   2.26590000e+05,   1.04896253e+07, ...,
          2.00000000e+00,   4.70000000e+01,   4.38000000e+02],
       ...,
       [  1.11239744e+09,   1.78446000e+05,   4.74903463e+06, ...,
          1.00000000e+00,   5.30000000e+01,   3.65500000e+03],
       [  1.11166223e+09,   2.86619000e+05,   1.12488263e+07, ...,
          1.00000000e+00,   1.90000000e+01,   1.13000000e+03],
       [  1.11235984e+09,   1.52316000e+05,   8.57449731e+06, ...,
          0.00000000e+00,   1.12000000e+02,   5.77000000e+02]])

In [ ]:
bagging = BaggingClassifier(KNeighborsClassifier(),
                            max_samples=0.5, max_features=0.5)

In [34]:
clf = RandomForestClassifier(n_estimators=20)

In [35]:
clf.fit(X_train, y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=20, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [36]:
pred = clf.predict(X_test)

In [37]:
print (accuracy_score(y_test, pred))
#n = 15 => 0.861844263255

0.864039535826

## Total datos

In [38]:
X_full_data = np.array(dfix)
X_full_data

array([[  1.11155610e+09,   3.65446000e+05,   7.03800731e+06, ...,
          0.00000000e+00,   0.00000000e+00,   0.00000000e+00],
       [  1.11237071e+09,   3.65446000e+05,   7.47688531e+06, ...,
          0.00000000e+00,   4.50000000e+01,   1.40000000e+01],
       [  1.11232666e+09,   3.65446000e+05,   9.80927731e+06, ...,
          0.00000000e+00,   4.00000000e+00,   3.30000000e+01],
       ...,
       [  1.11160188e+09,   3.23892000e+05,   8.13147410e+06, ...,
          0.00000000e+00,   6.00000000e+00,   7.10000000e+01],
       [  1.11131998e+09,   3.99727000e+05,   8.12986248e+06, ...,
          0.00000000e+00,   3.00000000e+00,   3.29000000e+02],
       [  1.11208492e+09,   1.20330000e+05,   8.12629305e+06, ...,
          0.00000000e+00,   1.40000000e+01,   1.85000000e+03]])

In [39]:
pred_full_data = clf.predict(X_full_data)

In [40]:
df['sepostulo'] = pred_full_data

In [41]:
df.head()

,idaviso,idpostulante,timestamp,valor_educacion,sexo,idtitulo,idzona,idciudad,idmapacalle,idtipo_de_trabajo,idnivel_laboral,idnombre_area,iddenominacion_empresa,se_postulo,sepostulo
0,1111556097,365446,7.038007e+06,17,1,0,0,0,0,0,0,0,0,1,1
1,1112370711,365446,7.476885e+06,17,1,6996,0,0,0,0,0,45,14,1,1
2,1112326655,365446,9.809277e+06,17,1,11827,0,0,0,0,0,4,33,1,1
3,1112350182,365446,8.856385e+06,17,1,2141,0,0,0,0,0,31,38,1,1
4,1112383837,365446,7.563903e+06,17,1,6942,0,0,0,0,0,75,46,1,1

## Subida

In [44]:
top100 = pd.read_csv("../test_final_100k.csv", encoding='utf-8')

In [45]:
id_postulantes = pd.read_csv('../data/final_data/entrenamiento_id_postulantes.csv', encoding='utf-8')
id_postulantes.drop('Unnamed: 0', axis=1, inplace=True)
id_postulantes.shape
id_postulantes.head()

  idpostulante  idpostulante2
0      pzeVW63         365446
1      PmVbBWY         209736
2      zvPMxvJ         409297
3       YYwJKq         250105
4      3NkMAVq          37024

In [46]:
top100_full = pd.merge(top100, id_postulantes, how='left', on='idpostulante')
top100_full.shape

(100000, 4)

In [47]:
top100_full.drop('idpostulante', inplace=True, axis=1)
top100_full.rename({'idpostulante2':'idpostulante'}, inplace=True, axis=1)
top100_full.head()

   id  idaviso  idpostulante
0   0   739260       63651.0
1   1   739260       76877.0
2   2   739260      323397.0
3   3   758580           NaN
4   4   758580      127342.0

In [48]:
top100_full = pd.merge(top100_full, df, how='left', on=['idaviso','idpostulante'])
top100_full.shape

(100000, 16)

In [49]:
top100_full = top100_full[['id', 'se_postulo', 'sepostulo']]
top100_full.head()

   id  se_postulo  sepostulo
0   0         NaN        NaN
1   1         NaN        NaN
2   2         NaN        NaN
3   3         NaN        NaN
4   4         NaN        NaN

In [50]:
top100_full.fillna(0, inplace=True)

In [51]:
top100_full['se_postulo'] = top100_full['se_postulo'].astype('int')
top100_full['sepostulo'] = top100_full['sepostulo'].astype('int')
top100_full.head()

   id  se_postulo  sepostulo
0   0           0          0
1   1           0          0
2   2           0          0
3   3           0          0
4   4           0          0

In [52]:
top100_full.loc[(top100_full['sepostulo'] == 0) & (top100_full['se_postulo'] == 1), 'sepostulo'] = 1
top100_full[(top100_full['sepostulo'] == 0) & (top100_full['se_postulo'] == 1)]['sepostulo']

Series([], Name: sepostulo, dtype: int64)

In [53]:
top100_full.drop('se_postulo', axis=1, inplace=True)

In [54]:
top100_full[top100_full['sepostulo'] == 1].shape

(33926, 2)

In [55]:
# top100_full.rename({'se_postulo' : 'sepostulo'}, inplace=True, axis=1)
top100_full.to_csv('../data/entrega/top100k_RandForestsn20.csv', encoding='utf-8', index=False)